module.exports.config = {
  // 依次是每个进度条的名字
  bars: ['怒气', 'GCD', '嗜血', '旋风斩', '目标血量', '主手英勇顺劈', '横扫攻击', '乘胜追击'],
  // 技能名称和案件的对应关系
  keyMap: {
    '嗜血': '1',
    '旋风斩': '2',
    '英勇': '3',
    '顺劈斩': '4',
    '乘胜追击': '5',
    '取消英勇': '6',
    '斩杀': 'E',
    '横扫攻击': 'T'
  },
  // 每次循环间隔 单位 ms
  interval: 200,
  // 进度条的起始位置和每个进度条的宽度高度
  barPosition: {
    x: 7,
    y: 42,
    width: 140,
    height: 14.5,
  },
  // barPosition: {
  //     x: 7,
  //     y: 86,
  //     width: 136,
  //     height: 14,
  // },
  // 单片机串口
  port: 'COM8'
};

let 下次英勇判断 = 0;
module.exports.loop = async function({ $, cast, sleep, now, mode }) {
  let 预估剩余怒气 = $.怒气;
  let gcdReady = $.GCD <= 10;

  if ($.乘胜追击 > 0 && $.怒气 > 0 && gcdReady) {
    cast('乘胜追击');
    gcdReady = false;
  }

  if (mode === 'AOE') {
    if ($.横扫攻击 >= 80) { // 横扫持续期间 AOE
      if ($.主手英勇顺劈 <= 0 && 预估剩余怒气 >= 20) {
        cast('顺劈斩');
        预估剩余怒气 -= 20;
      }
      if (gcdReady) {
        if ($.嗜血 <= 0 && 预估剩余怒气 >= 50) {
          cast('嗜血');
          预估剩余怒气 -= 30;
        } else if ($.旋风斩 <= 0 && 预估剩余怒气 >= 80) {
          cast('旋风斩');
          预估剩余怒气 -= 25;
        }
      }
    } else if (gcdReady) { // 非横扫持续 AOE
      if ($.旋风斩 <= 0 && 预估剩余怒气 >= 25) {
        cast('旋风斩');
        预估剩余怒气 -= 25;
      } else if ($.横扫攻击 <= 0 && 预估剩余怒气 >= 50) {
        cast('横扫攻击');
        await sleep(50);
        cast('顺劈斩');
        预估剩余怒气 -= 30;
      } else if ($.横扫攻击 > 10) {
        // 横扫可用时不打顺劈 存怒
        if ($.主手英勇顺劈 <= 0 && 预估剩余怒气 >= 20) {
          cast('顺劈斩');
          预估剩余怒气 -= 20;
        } else if ($.嗜血 <= 0 && 预估剩余怒气 >= 80) {
          cast('嗜血');
          预估剩余怒气 -= 30;
        }
      }
    }
  } else {
    if ($.目标血量 >= 20) { // 单体非斩杀
      if (预估剩余怒气 >= 30 && gcdReady) {
        if ($.嗜血 <= 0) {
          cast('嗜血');
          预估剩余怒气 -= 30;
        } else if ($.旋风斩 <= 0) {
          cast('旋风斩');
          预估剩余怒气 -= 25;
        }
      }
    } else { // 单体斩杀
      if (gcdReady && 预估剩余怒气 > 10) {
        cast('斩杀');
      }
    }

    if (now > 下次英勇判断) { // 单体卡英勇
      if ($.主手英勇顺劈 === 0 && 预估剩余怒气 > 10) {
        cast('英勇');
      } else if (预估剩余怒气 < 60 && $.主手英勇顺劈 > 80) {
        cast('取消英勇');
        下次英勇判断 = now + 500;
      }
    }
  }
}