module.exports.config = {
  // 依次是每个进度条的名字
  bars: [
    'GCD',
    '血1',
    '血2',
    '冰1',
    '冰2',
    '邪1',
    '邪2',
    '死1',
    '死2',
    '符能',
    '冰病',
    '血病',
    '号角',
    '冰雾',
    '杀戮',
    '分流',
    '铜墙',
    '增效',
    '复生',
    '凋零',
    '凛风',
  ],
  // 技能名称和案件的对应关系
  keyMap: {
    冰冷触摸: ['1', 'alt'],
    暗影打击: ['2', 'alt'],
    寒冬号角: ['3', 'alt'],
    铜墙铁壁: ['4', 'alt'],
    亡者复生: ['r', 'alt'],
    血沸: ['e', 'alt'],
    湮没: '1',
    冰霜打击: '2',
    凛风冲击: '3',
    鲜血打击: '4',
    传染: '5',
    活力分流: '6',
    死亡凋零: 'e',
    符文武器增效: '9',
  },
};

module.exports.loop = async function ({ $, cast, sleep, now, mode }) {
  if ($.GCD < 90) {
    return;
  }

  const 血符文 = $.血1 >= 99 || $.血2 >= 99;
  const 冰符文 = $.冰1 >= 99 || $.冰2 >= 99;
  const 邪符文 = $.邪1 >= 99 || $.邪2 >= 99;
  const 死符文 = ($.死1 >= 99 && $.血1 >= 99) || ($.死2 >= 99 && $.血2 >= 99);

  const 死符数 = ($.死1 >= 99 ? 1 : 0) + ($.死2 >= 99 ? 1 : 0);
  const 双死 = 死符数 === 2 && $.血1 >= 99 && $.血2 >= 99;

  if ($.号角 === 0) {
    return cast('寒冬号角');
  }

  if (mode === 'AOE') {
    if ($.冰雾) {
      return cast('凛风冲击');
    }
    if (血符文 && 冰符文 && 邪符文 && $.凋零 >= 99) {
      return cast('死亡凋零');
    }
    if ($.凛风 >= 99 && 冰符文 && 邪符文) {
      return cast('凛风冲击');
    }
    if ($.凛风 < 40 && 冰符文 && 邪符文) {
      return cast('湮没');
    }
    if (血符文) {
      return cast('血沸');
    }
    if ($.符能 >= 70) {
      return cast('冰霜打击');
    }
  } else {
    if ($.冰病 === 0) {
      if (冰符文 || 死符文) {
        cast('冰冷触摸');
      }
      return;
    }

    if ($.血病 === 0) {
      if (邪符文 || 死符文) {
        cast('暗影打击');
      }
      return;
    }

    if (双死 && ($.分流 > 95 || $.冰病 > 66)) {
      return cast('湮没');
    }

    if ($.血病 <= 40 || $.冰病 <= 40) {
      if (血符文 || 死符文) {
        return cast('传染');
      }
      // 即将断病，不应该打任何占据GCD的技能
      if ($.血病 <= 20 || $.冰病 <= 20) {
        if ($.分流 >= 99) {
          cast('活力分流');
          await sleep(50);
          return cast('传染');
        }
        return;
      }
    }

    if ($.铜墙 >= 99) {
      cast('铜墙铁壁');
      await sleep(50);
      if ($.分流 >= 99 && $.增效 >= 99) {
        cast('活力分流');
        await sleep(50);
      }
    }

    // 符文武器后短时间允许溢出符能
    if ($.符能 >= 80 && $.增效 >= 3) {
      return cast('冰霜打击');
    }

    if ((冰符文 || 死符文) && 邪符文) {
      return cast('湮没');
    }

    // 起手循环
    if ($.增效 >= 99 && !冰符文 && !邪符文 && $.铜墙 <= 15) {
      // 传染早补, 下一轮符文武器增效
      if (死符数 == 1 && 血符文) {
        return cast('传染');
      }
      if (死符数 == 2) {
        cast('符文武器增效');
        await sleep(500);
        return;
      }
    }

    if (血符文) {
      return cast('鲜血打击');
    }

    if ($.复生 >= 99) {
      return cast('亡者复生');
    }

    if ($.符能 >= 28) {
      return cast('冰霜打击');
    }

    if ($.冰雾 > 0 && $.杀戮 === 0) {
      return cast('凛风冲击');
    }

    if ($.号角 < 70) {
      return cast('寒冬号角');
    }
  }
};
